---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBackDirn2
source: html/27ed2bc0-a0b4-9b9d-56af-7c171cdb8af8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBackDirn2 Property

"Interior Minor Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeBackDirn2 { get; }
```